; Check that loop-spawning and task-simplify correctly handle a static memory allocation and
; nested spawn within a parallel loop body with a landingpad.
;
; RUN: opt < %s -passes="loop-spawning,task-simplify" -S | FileCheck %s
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128"
target triple = "arm64-apple-macosx14.0.0"

%struct.ggml_type_traits_t = type { ptr, i32, i64, i8, ptr, ptr, ptr, ptr, i32, i64 }
%struct.ggml_tensor = type { i32, i32, ptr, [4 x i64], [4 x i64], i32, [16 x i32], i32, ptr, [10 x ptr], i32, i64, i64, ptr, i64, ptr, [64 x i8], ptr, [8 x i8] }
%struct.ggml_compute_params = type { i32, i32, i32, i64, ptr }

@type_traits = external local_unnamed_addr global [24 x %struct.ggml_type_traits_t], align 8
@__csi_unit_func_base_id = internal global i64 0
@__csi_unit_func_exit_base_id = internal global i64 0
@__csi_unit_loop_base_id = internal global i64 0
@__csi_unit_loop_exit_base_id = internal global i64 0
@__csi_unit_bb_base_id = internal global i64 0
@__csi_unit_callsite_base_id = internal global i64 0
@__csi_unit_load_base_id = internal global i64 0
@__csi_unit_store_base_id = internal global i64 0
@__csi_unit_alloca_base_id = internal global i64 0
@__csi_unit_detach_base_id = internal global i64 0
@__csi_unit_task_base_id = internal global i64 0
@__csi_unit_task_exit_base_id = internal global i64 0
@__csi_unit_detach_continue_base_id = internal global i64 0
@__csi_unit_sync_base_id = internal global i64 0

!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !182, line: 30, baseType: !154)
!185 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !131, entity: !186, file: !152, line: 174)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !182, line: 31, baseType: !158)
!187 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !131, entity: !188, file: !152, line: 175)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !182, line: 32, baseType: !162)
!189 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !131, entity: !190, file: !152, line: 177)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !182, line: 33, baseType: !166)
!191 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !131, entity: !192, file: !152, line: 178)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !182, line: 34, baseType: !170)
!193 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !131, entity: !194, file: !152, line: 179)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !182, line: 35, baseType: !174)
!195 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !131, entity: !196, file: !152, line: 180)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !182, line: 36, baseType: !177)
!197 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !131, entity: !198, file: !152, line: 182)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !182, line: 40, baseType: !149)
!199 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !131, entity: !200, file: !152, line: 183)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !182, line: 41, baseType: !154)
!201 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !131, entity: !202, file: !152, line: 184)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !182, line: 42, baseType: !158)
!203 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !131, entity: !204, file: !152, line: 185)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !182, line: 43, baseType: !162)
!205 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !131, entity: !206, file: !152, line: 187)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !182, line: 44, baseType: !166)
!207 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !131, entity: !208, file: !152, line: 188)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !182, line: 45, baseType: !170)
!209 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !131, entity: !210, file: !152, line: 189)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !182, line: 46, baseType: !174)
!211 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !131, entity: !212, file: !152, line: 190)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !182, line: 47, baseType: !177)
!213 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !131, entity: !214, file: !152, line: 192)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !215, line: 32, baseType: !216)
!215 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/sys/_types/_intptr_t.h", directory: "")
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !217, line: 27, baseType: !140)
!217 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/arm/_types.h", directory: "")
!218 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !131, entity: !219, file: !152, line: 193)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !220, line: 34, baseType: !143)
!220 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!221 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !131, entity: !222, file: !152, line: 195)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !223, line: 32, baseType: !140)
!223 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/_types/_intmax_t.h", directory: "")
!224 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !131, entity: !225, file: !152, line: 196)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !226, line: 32, baseType: !143)
!226 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/_types/_uintmax_t.h", directory: "")
!227 = !{!"clang version 17.0.6 (git@github.com:OpenCilk/opencilk-project.git c85f242a46d579145a8538338c78acd94c43c5f4)"}
!228 = distinct !DISubprogram(name: "ggml_compute_forward_mul_mat", linkageName: "_Z28ggml_compute_forward_mul_matPK19ggml_compute_paramsP11ggml_tensor", scope: !229, file: !229, line: 33, type: !230, scopeLine: 35, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !7, retainedNodes: !282)
!229 = !DIFile(filename: "ggml_compute_forward_mul_mat.cpp", directory: "/Users/neboat/Software/llama.cpp")
!230 = !DISubroutineType(types: !231)
!231 = !{null, !232, !242}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ggml_compute_params", file: !11, line: 648, size: 256, flags: DIFlagTypePassByValue, elements: !235, identifier: "_ZTS19ggml_compute_params")
!235 = !{!236, !237, !238, !239, !240}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !234, file: !11, line: 649, baseType: !10, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ith", scope: !234, file: !11, line: 652, baseType: !160, size: 32, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "nth", scope: !234, file: !11, line: 652, baseType: !160, size: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "wsize", scope: !234, file: !11, line: 655, baseType: !142, size: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !234, file: !11, line: 656, baseType: !241, size: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ggml_tensor", file: !11, line: 532, size: 2944, flags: DIFlagTypePassByValue, elements: !244, identifier: "_ZTS11ggml_tensor")
!244 = !{!245, !246, !247, !250, !254, !256, !257, !261, !262, !263, !267, !268, !269, !270, !271, !272, !273, !277, !278}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !243, file: !11, line: 533, baseType: !17, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "backend", scope: !243, file: !11, line: 534, baseType: !42, size: 32, offset: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !243, file: !11, line: 536, baseType: !248, size: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "ggml_backend_buffer", file: !11, line: 536, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS19ggml_backend_buffer")
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ne", scope: !243, file: !11, line: 538, baseType: !251, size: 256, offset: 128)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 256, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 4)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "nb", scope: !243, file: !11, line: 539, baseType: !255, size: 256, offset: 384)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 256, elements: !252)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !243, file: !11, line: 545, baseType: !47, size: 32, offset: 640)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "op_params", scope: !243, file: !11, line: 548, baseType: !258, size: 512, offset: 672)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 512, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 16)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !243, file: !11, line: 550, baseType: !158, size: 32, offset: 1184)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "grad", scope: !243, file: !11, line: 552, baseType: !242, size: 64, offset: 1216)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !243, file: !11, line: 553, baseType: !264, size: 640, offset: 1280)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 640, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 10)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "perf_runs", scope: !243, file: !11, line: 556, baseType: !160, size: 32, offset: 1920)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "perf_cycles", scope: !243, file: !11, line: 557, baseType: !162, size: 64, offset: 1984)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "perf_time_us", scope: !243, file: !11, line: 558, baseType: !162, size: 64, offset: 2048)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "view_src", scope: !243, file: !11, line: 560, baseType: !242, size: 64, offset: 2112)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "view_offs", scope: !243, file: !11, line: 561, baseType: !142, size: 64, offset: 2176)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !243, file: !11, line: 563, baseType: !241, size: 64, offset: 2240)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !243, file: !11, line: 565, baseType: !274, size: 512, offset: 2304)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 512, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !243, file: !11, line: 567, baseType: !241, size: 64, offset: 2816)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !243, file: !11, line: 569, baseType: !279, size: 64, offset: 2880)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 64, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 8)
!282 = !{!283, !284, !285, !288, !289, !291, !292, !293, !294, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !317, !318, !320, !323, !331, !332, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !363, !364, !365, !366, !368, !371, !372, !373, !374, !376, !381, !383, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !398}
!283 = !DILocalVariable(name: "params", arg: 1, scope: !228, file: !229, line: 34, type: !232)
!284 = !DILocalVariable(name: "dst", arg: 2, scope: !228, file: !229, line: 35, type: !242)
!285 = !DILocalVariable(name: "src0", scope: !228, file: !229, line: 37, type: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !243)
!288 = !DILocalVariable(name: "src1", scope: !228, file: !229, line: 38, type: !286)
!289 = !DILocalVariable(name: "ne00", scope: !228, file: !229, line: 43, type: !290)
!290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!291 = !DILocalVariable(name: "ne01", scope: !228, file: !229, line: 43, type: !290)
!292 = !DILocalVariable(name: "ne02", scope: !228, file: !229, line: 43, type: !290)
!293 = !DILocalVariable(name: "ne03", scope: !228, file: !229, line: 43, type: !290)
!294 = !DILocalVariable(name: "nb00", scope: !228, file: !229, line: 43, type: !295)
!295 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!296 = !DILocalVariable(name: "nb01", scope: !228, file: !229, line: 43, type: !295)
!297 = !DILocalVariable(name: "nb02", scope: !228, file: !229, line: 43, type: !295)
!298 = !DILocalVariable(name: "nb03", scope: !228, file: !229, line: 43, type: !295)
!299 = !DILocalVariable(name: "ne10", scope: !228, file: !229, line: 43, type: !290)
!300 = !DILocalVariable(name: "ne11", scope: !228, file: !229, line: 43, type: !290)
!301 = !DILocalVariable(name: "ne12", scope: !228, file: !229, line: 43, type: !290)
!302 = !DILocalVariable(name: "ne13", scope: !228, file: !229, line: 43, type: !290)
!303 = !DILocalVariable(name: "nb10", scope: !228, file: !229, line: 43, type: !295)
!304 = !DILocalVariable(name: "nb11", scope: !228, file: !229, line: 43, type: !295)
!305 = !DILocalVariable(name: "nb12", scope: !228, file: !229, line: 43, type: !295)
!306 = !DILocalVariable(name: "nb13", scope: !228, file: !229, line: 43, type: !295)
!307 = !DILocalVariable(name: "ne0", scope: !228, file: !229, line: 43, type: !290)
!308 = !DILocalVariable(name: "ne1", scope: !228, file: !229, line: 43, type: !290)
!309 = !DILocalVariable(name: "ne2", scope: !228, file: !229, line: 43, type: !290)
!310 = !DILocalVariable(name: "ne3", scope: !228, file: !229, line: 43, type: !290)
!311 = !DILocalVariable(name: "nb0", scope: !228, file: !229, line: 43, type: !295)
!312 = !DILocalVariable(name: "nb1", scope: !228, file: !229, line: 43, type: !295)
!313 = !DILocalVariable(name: "nb2", scope: !228, file: !229, line: 43, type: !295)
!314 = !DILocalVariable(name: "nb3", scope: !228, file: !229, line: 43, type: !295)
!315 = !DILocalVariable(name: "ith", scope: !228, file: !229, line: 45, type: !316)
!316 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!317 = !DILocalVariable(name: "nth", scope: !228, file: !229, line: 46, type: !316)
!318 = !DILocalVariable(name: "type", scope: !228, file: !229, line: 48, type: !319)
!319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!320 = !DILocalVariable(name: "src1_cont", scope: !228, file: !229, line: 50, type: !321)
!321 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !322)
!322 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
