; Check that Tapir lowering perperly handles debug information around
; taskframe.end intrinsics.
;
; RUN: opt < %s -tapir2target -tapir-target=opencilk -opencilk-runtime-bc-path=%S/libopencilk-abi.bc -S | FileCheck %s
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"class.std::ios_base::Init" = type { i8 }
%"struct.std::pair" = type { i32, i32 }
%struct.seg = type { i32, i32 }
%struct.pairCompF = type { i8 }

@_ZStL8__ioinit = internal global %"class.std::ios_base::Init" zeroinitializer, align 1, !dbg !0
@__dso_handle = external hidden global i8
@llvm.global_ctors = appending global [1 x { i32, void ()*, i8* }] [{ i32, void ()*, i8* } { i32 65535, void ()* @_GLOBAL__sub_I_test.C, i8* null }]

declare dso_local void @_ZNSt8ios_base4InitC1Ev(%"class.std::ios_base::Init"* noundef nonnull align 1 dereferenceable(1)) unnamed_addr #0

; Function Attrs: nounwind
declare dso_local void @_ZNSt8ios_base4InitD1Ev(%"class.std::ios_base::Init"* noundef nonnull align 1 dereferenceable(1)) unnamed_addr #1

; Function Attrs: nofree nounwind
declare dso_local i32 @__cxa_atexit(void (i8*)*, i8*, i8*) local_unnamed_addr #2

; Function Attrs: nounwind
declare !dbg !1536 dso_local i32 @mallopt(i32 noundef, i32 noundef) local_unnamed_addr #1

; Function Attrs: uwtable

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__ioinit", linkageName: "_ZStL8__ioinit", scope: !2, file: !3, line: 74, type: !4, isLocal: true, isDefinition: true)
!2 = !DINamespace(name: "std", scope: null)
!3 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/11/../../../../include/c++/11/iostream", directory: "")
!4 = !DICompositeType(tag: DW_TAG_class_type, name: "Init", scope: !6, file: !5, line: 626, size: 8, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSNSt8ios_base4InitE")
!5 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/11/../../../../include/c++/11/bits/ios_base.h", directory: "")
!6 = !DICompositeType(tag: DW_TAG_class_type, name: "ios_base", scope: !2, file: !5, line: 228, size: 1728, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSSt8ios_base")
!7 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !8, producer: "clang version 14.0.4 (git@github.com:OpenCilk/opencilk-project.git 2e1fb15277debdae89be84f4686572bf4c87b06b)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !9, globals: !203, imports: !211, splitDebugInlining: false, nameTableKind: None)
!8 = !DIFile(filename: "test.C", directory: "/data/compilers/tests/benchmarks/pbbs/suffixArray/parallelRange", checksumkind: CSK_MD5, checksum: "e6994d47b4bdae15c606ea65599b365a")
!9 = !{!10, !31, !77, !147, !167}
!10 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "__pair_base<unsigned int, unsigned int>", scope: !2, file: !11, line: 189, size: 8, flags: DIFlagTypePassByValue, elements: !12, templateParams: !27, identifier: "_ZTSSt11__pair_baseIjjE")
!11 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/11/../../../../include/c++/11/bits/stl_pair.h", directory: "", checksumkind: CSK_MD5, checksum: "7f4523a2a9644730e7f1af988b6f398d")
!12 = !{!13, !17, !18, !23}
!13 = !DISubprogram(name: "__pair_base", scope: !10, file: !11, line: 193, type: !14, scopeLine: 193, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!14 = !DISubroutineType(types: !15)
!15 = !{null, !16}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!17 = !DISubprogram(name: "~__pair_base", scope: !10, file: !11, line: 194, type: !14, scopeLine: 194, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!18 = !DISubprogram(name: "__pair_base", scope: !10, file: !11, line: 195, type: !19, scopeLine: 195, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!19 = !DISubroutineType(types: !20)
!20 = !{null, !16, !21}
!21 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!23 = !DISubprogram(name: "operator=", linkageName: "_ZNSt11__pair_baseIjjEaSERKS0_", scope: !10, file: !11, line: 196, type: !24, scopeLine: 196, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!24 = !DISubroutineType(types: !25)
!25 = !{!26, !16, !21}
!26 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !10, size: 64)
!27 = !{!28, !30}
!28 = !DITemplateTypeParameter(name: "_U1", type: !29)
!29 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!30 = !DITemplateTypeParameter(name: "_U2", type: !29)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<unsigned int, unsigned int>", scope: !2, file: !11, line: 211, size: 64, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !32, templateParams: !74, identifier: "_ZTSSt4pairIjjE")
!32 = !{!33, !34, !35, !36, !42, !46, !62, !71}
!33 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !31, baseType: !10, flags: DIFlagPrivate, extraData: i32 0)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !31, file: !11, line: 217, baseType: !29, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "second", scope: !31, file: !11, line: 218, baseType: !29, size: 32, offset: 32)
!36 = !DISubprogram(name: "pair", scope: !31, file: !11, line: 314, type: !37, scopeLine: 314, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !39, !40}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!40 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!42 = !DISubprogram(name: "pair", scope: !31, file: !11, line: 315, type: !43, scopeLine: 315, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!43 = !DISubroutineType(types: !44)
!44 = !{null, !39, !45}
!45 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !31, size: 64)
!46 = !DISubprogram(name: "operator=", linkageName: "_ZNSt4pairIjjEaSERKS0_", scope: !31, file: !11, line: 390, type: !47, scopeLine: 390, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !39, !50}
!49 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !31, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "type", scope: !52, file: !51, line: 2227, baseType: !40)
!51 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/11/../../../../include/c++/11/type_traits", directory: "")
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conditional<true, const std::pair<unsigned int, unsigned int> &, const std::__nonesuch &>", scope: !2, file: !51, line: 2226, size: 8, flags: DIFlagTypePassByValue, elements: !53, templateParams: !54, identifier: "_ZTSSt11conditionalILb1ERKSt4pairIjjERKSt10__nonesuchE")
!53 = !{}
!54 = !{!55, !57, !58}
!55 = !DITemplateValueParameter(name: "_Cond", type: !56, value: i8 1)
!56 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!57 = !DITemplateTypeParameter(name: "_Iftrue", type: !40)
!58 = !DITemplateTypeParameter(name: "_Iffalse", type: !59)
!59 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "__nonesuch", scope: !2, file: !51, line: 2984, size: 8, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSSt10__nonesuch")
!62 = !DISubprogram(name: "operator=", linkageName: "_ZNSt4pairIjjEaSEOS0_", scope: !31, file: !11, line: 401, type: !63, scopeLine: 401, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!63 = !DISubroutineType(types: !64)
!64 = !{!49, !39, !65}
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "type", scope: !66, file: !51, line: 2227, baseType: !45)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conditional<true, std::pair<unsigned int, unsigned int> &&, std::__nonesuch &&>", scope: !2, file: !51, line: 2226, size: 8, flags: DIFlagTypePassByValue, elements: !53, templateParams: !67, identifier: "_ZTSSt11conditionalILb1EOSt4pairIjjEOSt10__nonesuchE")
!67 = !{!55, !68, !69}
!68 = !DITemplateTypeParameter(name: "_Iftrue", type: !45)
!69 = !DITemplateTypeParameter(name: "_Iffalse", type: !70)
!70 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !61, size: 64)
!71 = !DISubprogram(name: "swap", linkageName: "_ZNSt4pairIjjE4swapERS0_", scope: !31, file: !11, line: 439, type: !72, scopeLine: 439, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!72 = !DISubroutineType(types: !73)
!73 = !{null, !39, !49}
!74 = !{!75, !76}
!75 = !DITemplateTypeParameter(name: "_T1", type: !29)
!76 = !DITemplateTypeParameter(name: "_T2", type: !29)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timer", file: !78, line: 13, size: 704, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !79, identifier: "_ZTS5timer")
!78 = !DIFile(filename: "./gettime.h", directory: "/data/compilers/tests/benchmarks/pbbs/suffixArray/parallelRange", checksumkind: CSK_MD5, checksum: "537cedf827c668144f3c70313729c9df")
!79 = !{!80, !82, !83, !84, !98, !99, !100, !107, !111, !112, !115, !116, !117, !120, !121, !122, !125, !126, !129, !132, !133, !141, !142, !145, !146}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "totalTime", scope: !77, file: !78, line: 14, baseType: !81, size: 64)
!81 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "lastTime", scope: !77, file: !78, line: 15, baseType: !81, size: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "totalWeight", scope: !77, file: !78, line: 16, baseType: !81, size: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "totalWSP", scope: !77, file: !78, line: 17, baseType: !85, size: 192, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "wsp_t", file: !86, line: 16, baseType: !87)
!86 = !DIFile(filename: "work/opencilk/build-14/lib/clang/14.0.4/include/cilk/cilkscale.h", directory: "/data", checksumkind: CSK_MD5, checksum: "cd86758990dd7140e514e96c71ea96b6")
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wsp_t", file: !86, line: 12, size: 192, flags: DIFlagTypePassByValue, elements: !88, identifier: "_ZTS5wsp_t")
!88 = !{!89, !96, !97}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !87, file: !86, line: 13, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_duration_t", file: !86, line: 11, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !92, line: 27, baseType: !93)
!92 = !DIFile(filename: "/usr/include/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "b26974ec56196748bbc399ee826d2a0e")
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !94, line: 44, baseType: !95)
!94 = !DIFile(filename: "/usr/include/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "58b79843d97f4309eefa4aa722dac91e")
!95 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "span", scope: !87, file: !86, line: 14, baseType: !90, size: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "bspan", scope: !87, file: !86, line: 15, baseType: !90, size: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "lastWSP", scope: !77, file: !78, line: 18, baseType: !85, size: 192, offset: 384)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !77, file: !78, line: 19, baseType: !56, size: 8, offset: 576)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "tzp", scope: !77, file: !78, line: 20, baseType: !101, size: 64, offset: 608)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timezone", file: !102, line: 52, size: 64, flags: DIFlagTypePassByValue, elements: !103, identifier: "_ZTS8timezone")
!102 = !DIFile(filename: "/usr/include/sys/time.h", directory: "", checksumkind: CSK_MD5, checksum: "46b85b5c78b9f1633c1b138025a7b02e")
!103 = !{!104, !106}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "tz_minuteswest", scope: !101, file: !102, line: 54, baseType: !105, size: 32)
!105 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tz_dsttime", scope: !101, file: !102, line: 55, baseType: !105, size: 32, offset: 32)
!107 = !DISubprogram(name: "timer", scope: !77, file: !78, line: 21, type: !108, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!108 = !DISubroutineType(types: !109)
!109 = !{null, !110}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!111 = !DISubprogram(name: "clear", linkageName: "_ZN5timer5clearEv", scope: !77, file: !78, line: 27, type: !108, scopeLine: 27, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!112 = !DISubprogram(name: "getTime", linkageName: "_ZN5timer7getTimeEv", scope: !77, file: !78, line: 28, type: !113, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!113 = !DISubroutineType(types: !114)
!114 = !{!81, !110}
!115 = !DISubprogram(name: "start", linkageName: "_ZN5timer5startEv", scope: !77, file: !78, line: 33, type: !108, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!116 = !DISubprogram(name: "stop", linkageName: "_ZN5timer4stopEv", scope: !77, file: !78, line: 38, type: !113, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!117 = !DISubprogram(name: "stop", linkageName: "_ZN5timer4stopEd", scope: !77, file: !78, line: 45, type: !118, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!118 = !DISubroutineType(types: !119)
!119 = !{!81, !110, !81}
!120 = !DISubprogram(name: "total", linkageName: "_ZN5timer5totalEv", scope: !77, file: !78, line: 54, type: !113, scopeLine: 54, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!121 = !DISubprogram(name: "next", linkageName: "_ZN5timer4nextEv", scope: !77, file: !78, line: 59, type: !113, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!122 = !DISubprogram(name: "total_wsp", linkageName: "_ZN5timer9total_wspEv", scope: !77, file: !78, line: 68, type: !123, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!123 = !DISubroutineType(types: !124)
!124 = !{!85, !110}
!125 = !DISubprogram(name: "next_wsp", linkageName: "_ZN5timer8next_wspEv", scope: !77, file: !78, line: 73, type: !123, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!126 = !DISubprogram(name: "reportT", linkageName: "_ZN5timer7reportTEd", scope: !77, file: !78, line: 82, type: !127, scopeLine: 82, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!127 = !DISubroutineType(types: !128)
!128 = !{null, !110, !81}
!129 = !DISubprogram(name: "reportWSP", linkageName: "_ZN5timer9reportWSPE5wsp_t", scope: !77, file: !78, line: 86, type: !130, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!130 = !DISubroutineType(types: !131)
!131 = !{null, !110, !85}
!132 = !DISubprogram(name: "reportTime", linkageName: "_ZN5timer10reportTimeEd", scope: !77, file: !78, line: 90, type: !127, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!133 = !DISubprogram(name: "reportStop", linkageName: "_ZN5timer10reportStopEdNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE", scope: !77, file: !78, line: 94, type: !134, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!134 = !DISubroutineType(types: !135)
!135 = !{null, !110, !81, !136}
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "string", scope: !2, file: !137, line: 79, baseType: !138)
!137 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/11/../../../../include/c++/11/bits/stringfwd.h", directory: "")
!138 = !DICompositeType(tag: DW_TAG_class_type, name: "basic_string<char, std::char_traits<char>, std::allocator<char> >", scope: !140, file: !139, line: 1627, size: 256, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE")
!139 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/11/../../../../include/c++/11/bits/basic_string.tcc", directory: "")
!140 = !DINamespace(name: "__cxx11", scope: !2, exportSymbols: true)
!141 = !DISubprogram(name: "reportTotal", linkageName: "_ZN5timer11reportTotalEv", scope: !77, file: !78, line: 99, type: !108, scopeLine: 99, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!142 = !DISubprogram(name: "reportTotal", linkageName: "_ZN5timer11reportTotalENSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE", scope: !77, file: !78, line: 108, type: !143, scopeLine: 108, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !110, !136}
!145 = !DISubprogram(name: "reportNext", linkageName: "_ZN5timer10reportNextEv", scope: !77, file: !78, line: 115, type: !108, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!146 = !DISubprogram(name: "reportNext", linkageName: "_ZN5timer10reportNextENSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE", scope: !77, file: !78, line: 117, type: !143, scopeLine: 117, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!147 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "__pair_base<std::pair<unsigned int, unsigned int> *, std::pair<unsigned int, unsigned int> *>", scope: !2, file: !11, line: 189, size: 8, flags: DIFlagTypePassByValue, elements: !148, templateParams: !163, identifier: "_ZTSSt11__pair_baseIPSt4pairIjjES2_E")
!148 = !{!149, !153, !154, !159}
!149 = !DISubprogram(name: "__pair_base", scope: !147, file: !11, line: 193, type: !150, scopeLine: 193, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !152}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!153 = !DISubprogram(name: "~__pair_base", scope: !147, file: !11, line: 194, type: !150, scopeLine: 194, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!154 = !DISubprogram(name: "__pair_base", scope: !147, file: !11, line: 195, type: !155, scopeLine: 195, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!155 = !DISubroutineType(types: !156)
!156 = !{null, !152, !157}
!157 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!159 = !DISubprogram(name: "operator=", linkageName: "_ZNSt11__pair_baseIPSt4pairIjjES2_EaSERKS3_", scope: !147, file: !11, line: 196, type: !160, scopeLine: 196, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!160 = !DISubroutineType(types: !161)
!161 = !{!162, !152, !157}
!162 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !147, size: 64)
!163 = !{!164, !166}
!164 = !DITemplateTypeParameter(name: "_U1", type: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!166 = !DITemplateTypeParameter(name: "_U2", type: !165)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<std::pair<unsigned int, unsigned int> *, std::pair<unsigned int, unsigned int> *>", scope: !2, file: !11, line: 211, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !168, templateParams: !200, identifier: "_ZTSSt4pairIPS_IjjES1_E")
!168 = !{!169, !170, !171, !172, !178, !182, !190, !197}
!169 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !167, baseType: !147, flags: DIFlagPrivate, extraData: i32 0)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !167, file: !11, line: 217, baseType: !165, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "second", scope: !167, file: !11, line: 218, baseType: !165, size: 64, offset: 64)
!172 = !DISubprogram(name: "pair", scope: !167, file: !11, line: 314, type: !173, scopeLine: 314, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!173 = !DISubroutineType(types: !174)
!174 = !{null, !175, !176}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!176 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!178 = !DISubprogram(name: "pair", scope: !167, file: !11, line: 315, type: !179, scopeLine: 315, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!179 = !DISubroutineType(types: !180)
!180 = !{null, !175, !181}
!181 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !167, size: 64)
!182 = !DISubprogram(name: "operator=", linkageName: "_ZNSt4pairIPS_IjjES1_EaSERKS2_", scope: !167, file: !11, line: 390, type: !183, scopeLine: 390, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!183 = !DISubroutineType(types: !184)
!184 = !{!185, !175, !186}
!185 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !167, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "type", scope: !187, file: !51, line: 2227, baseType: !176)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conditional<true, const std::pair<std::pair<unsigned int, unsigned int> *, std::pair<unsigned int, unsigned int> *> &, const std::__nonesuch &>", scope: !2, file: !51, line: 2226, size: 8, flags: DIFlagTypePassByValue, elements: !53, templateParams: !188, identifier: "_ZTSSt11conditionalILb1ERKSt4pairIPS0_IjjES2_ERKSt10__nonesuchE")
!188 = !{!55, !189, !58}
!189 = !DITemplateTypeParameter(name: "_Iftrue", type: !176)
!190 = !DISubprogram(name: "operator=", linkageName: "_ZNSt4pairIPS_IjjES1_EaSEOS2_", scope: !167, file: !11, line: 401, type: !191, scopeLine: 401, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!191 = !DISubroutineType(types: !192)
!192 = !{!185, !175, !193}
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "type", scope: !194, file: !51, line: 2227, baseType: !181)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conditional<true, std::pair<std::pair<unsigned int, unsigned int> *, std::pair<unsigned int, unsigned int> *> &&, std::__nonesuch &&>", scope: !2, file: !51, line: 2226, size: 8, flags: DIFlagTypePassByValue, elements: !53, templateParams: !195, identifier: "_ZTSSt11conditionalILb1EOSt4pairIPS0_IjjES2_EOSt10__nonesuchE")
!195 = !{!55, !196, !69}
!196 = !DITemplateTypeParameter(name: "_Iftrue", type: !181)
!197 = !DISubprogram(name: "swap", linkageName: "_ZNSt4pairIPS_IjjES1_E4swapERS2_", scope: !167, file: !11, line: 439, type: !198, scopeLine: 439, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!198 = !DISubroutineType(types: !199)
!199 = !{null, !175, !185}
!200 = !{!201, !202}
!201 = !DITemplateTypeParameter(name: "_T1", type: !165)
!202 = !DITemplateTypeParameter(name: "_T2", type: !165)
!203 = !{!0, !204, !206, !209}
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "_tm", linkageName: "_ZL3_tm", scope: !7, file: !78, line: 120, type: !77, isLocal: true, isDefinition: true)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "__ii", linkageName: "_ZL4__ii", scope: !7, file: !208, line: 38, type: !105, isLocal: true, isDefinition: true)
!208 = !DIFile(filename: "./utils.h", directory: "/data/compilers/tests/benchmarks/pbbs/suffixArray/parallelRange", checksumkind: CSK_MD5, checksum: "9def8f7d06ffc5a7267f1ea19daca9d9")
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "__jj", linkageName: "_ZL4__jj", scope: !7, file: !208, line: 39, type: !105, isLocal: true, isDefinition: true)
!211 = !{!212, !230, !233, !238, !301, !309, !313, !320, !324, !328, !330, !332, !336, !345, !349, !355, !361, !363, !367, !371, !375, !379, !391, !393, !397, !401, !405, !407, !412, !416, !420, !422, !424, !428, !449, !453, !457, !461, !463, !469, !471, !477, !482, !486, !490, !494, !498, !502, !504, !506, !510, !514, !518, !520, !524, !528, !530, !532, !536, !542, !547, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !566, !570, !574, !578, !582, !585, !586, !589, !591, !593, !595, !598, !601, !604, !607, !610, !612, !617, !620, !623, !626, !628, !630, !632, !634, !637, !640, !643, !646, !649, !651, !655, !659, !664, !670, !672, !674, !676, !678, !680, !682, !684, !686, !688, !690, !692, !694, !696, !700, !704, !710, !714, !719, !721, !726, !730, !734, !745, !749, !753, !757, !761, !765, !769, !773, !777, !781, !785, !789, !793, !795, !799, !803, !807, !813, !817, !821, !823, !827, !831, !837, !839, !843, !847, !851, !855, !859, !863, !867, !868, !869, !870, !872, !873, !874, !875, !876, !877, !878, !882, !888, !893, !897, !899, !901, !903, !905, !912, !916, !920, !924, !928, !932, !937, !941, !943, !947, !953, !957, !962, !964, !967, !971, !975, !979, !981, !983, !985, !987, !991, !993, !995, !999, !1003, !1007, !1011, !1015, !1017, !1019, !1023, !1027, !1031, !1035, !1037, !1039, !1043, !1047, !1048, !1049, !1050, !1051, !1052, !1058, !1061, !1062, !1064, !1066, !1068, !1070, !1074, !1076, !1078, !1080, !1082, !1084, !1086, !1088, !1090, !1094, !1098, !1100, !1104, !1108, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1149, !1153, !1154, !1159, !1163, !1168, !1173, !1177, !1183, !1187, !1189, !1193, !1195, !1201, !1203, !1205, !1209, !1211, !1213, !1215, !1217, !1219, !1221, !1223, !1228, !1232, !1234, !1236, !1241, !1243, !1245, !1247, !1249, !1251, !1253, !1256, !1258, !1260, !1264, !1266, !1268, !1270, !1272, !1274, !1276, !1278, !1280, !1282, !1284, !1286, !1290, !1294, !1296, !1298, !1300, !1302, !1304, !1306, !1308, !1310, !1312, !1314, !1316, !1318, !1320, !1322, !1324, !1328, !1332, !1336, !1338, !1340, !1342, !1344, !1346, !1348, !1350, !1352, !1354, !1358, !1362, !1366, !1368, !1370, !1372, !1376, !1380, !1384, !1386, !1388, !1390, !1392, !1394, !1396, !1398, !1400, !1402, !1404, !1406, !1408, !1412, !1416, !1420, !1422, !1424, !1426, !1428, !1432, !1436, !1438, !1440, !1442, !1444, !1446, !1448, !1452, !1456, !1458, !1460, !1462, !1464, !1468, !1472, !1476, !1478, !1480, !1482, !1484, !1486, !1488, !1492, !1496, !1500, !1502, !1506, !1510, !1512, !1514, !1516, !1518, !1520, !1522, !1524, !1529}
!212 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !213, file: !229, line: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !214, line: 6, baseType: !215)
!214 = !DIFile(filename: "/usr/include/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !216, line: 21, baseType: !217)
!216 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !216, line: 13, size: 64, flags: DIFlagTypePassByValue, elements: !218, identifier: "_ZTS11__mbstate_t")
!218 = !{!219, !220}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !217, file: !216, line: 15, baseType: !105, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !217, file: !216, line: 20, baseType: !221, size: 32, offset: 32)
!221 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !217, file: !216, line: 16, size: 32, flags: DIFlagTypePassByValue, elements: !222, identifier: "_ZTSN11__mbstate_tUt_E")
!222 = !{!223, !224}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !221, file: !216, line: 18, baseType: !29, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !221, file: !216, line: 19, baseType: !225, size: 32)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 32, elements: !227)
!226 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!227 = !{!228}
!228 = !DISubrange(count: 4)
!229 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/11/../../../../include/c++/11/cwchar", directory: "")
!230 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !231, file: !229, line: 141)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !232, line: 20, baseType: !29)
!232 = !DIFile(filename: "/usr/include/bits/types/wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "aa31b53ef28dc23152ceb41e2763ded3")
!233 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !234, file: !229, line: 143)
!234 = !DISubprogram(name: "btowc", scope: !235, file: !235, line: 318, type: !236, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!235 = !DIFile(filename: "/usr/include/wchar.h", directory: "", checksumkind: CSK_MD5, checksum: "2cfc37aee21a7beb831c2e2e96a66ff0")
!236 = !DISubroutineType(types: !237)
!237 = !{!231, !105}
!238 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !239, file: !229, line: 144)
!239 = !DISubprogram(name: "fgetwc", scope: !235, file: !235, line: 729, type: !240, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!240 = !DISubroutineType(types: !241)
!241 = !{!231, !242}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !244, line: 5, baseType: !245)
!244 = !DIFile(filename: "/usr/include/bits/types/__FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "72a8fe90981f484acae7c6f3dfc5c2b7")
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !246, line: 49, size: 1728, flags: DIFlagTypePassByValue, elements: !247, identifier: "_ZTS8_IO_FILE")
!246 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "daf3a34cdce4be51765788919d95b2d5")
!247 = !{!248, !249, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !264, !266, !267, !268, !270, !272, !274, !278, !281, !283, !286, !289, !290, !292, !296, !297}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !245, file: !246, line: 51, baseType: !105, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !245, file: !246, line: 54, baseType: !250, size: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !245, file: !246, line: 55, baseType: !250, size: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !245, file: !246, line: 56, baseType: !250, size: 64, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !245, file: !246, line: 57, baseType: !250, size: 64, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !245, file: !246, line: 58, baseType: !250, size: 64, offset: 320)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !245, file: !246, line: 59, baseType: !250, size: 64, offset: 384)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !245, file: !246, line: 60, baseType: !250, size: 64, offset: 448)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !245, file: !246, line: 61, baseType: !250, size: 64, offset: 512)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !245, file: !246, line: 64, baseType: !250, size: 64, offset: 576)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !245, file: !246, line: 65, baseType: !250, size: 64, offset: 640)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !245, file: !246, line: 66, baseType: !250, size: 64, offset: 704)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !245, file: !246, line: 68, baseType: !262, size: 64, offset: 768)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !246, line: 36, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS10_IO_marker")
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !245, file: !246, line: 70, baseType: !265, size: 64, offset: 832)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !245, file: !246, line: 72, baseType: !105, size: 32, offset: 896)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !245, file: !246, line: 73, baseType: !105, size: 32, offset: 928)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !245, file: !246, line: 74, baseType: !269, size: 64, offset: 960)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !94, line: 152, baseType: !95)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !245, file: !246, line: 77, baseType: !271, size: 16, offset: 1024)
!271 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !245, file: !246, line: 78, baseType: !273, size: 8, offset: 1040)
!273 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !245, file: !246, line: 79, baseType: !275, size: 8, offset: 1048)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 8, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 1)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !245, file: !246, line: 81, baseType: !279, size: 64, offset: 1088)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !246, line: 43, baseType: null)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !245, file: !246, line: 89, baseType: !282, size: 64, offset: 1152)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !94, line: 153, baseType: !95)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !245, file: !246, line: 91, baseType: !284, size: 64, offset: 1216)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !246, line: 37, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS11_IO_codecvt")
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !245, file: !246, line: 92, baseType: !287, size: 64, offset: 1280)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !246, line: 38, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS13_IO_wide_data")
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !245, file: !246, line: 93, baseType: !265, size: 64, offset: 1344)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !245, file: !246, line: 94, baseType: !291, size: 64, offset: 1408)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !245, file: !246, line: 95, baseType: !293, size: 64, offset: 1472)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !294, line: 46, baseType: !295)
!294 = !DIFile(filename: "work/opencilk/build-14/lib/clang/14.0.4/include/stddef.h", directory: "/data", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!295 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !245, file: !246, line: 96, baseType: !105, size: 32, offset: 1536)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !245, file: !246, line: 98, baseType: !298, size: 160, offset: 1568)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 160, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 20)
!301 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !302, file: !229, line: 145)
!302 = !DISubprogram(name: "fgetws", scope: !235, file: !235, line: 758, type: !303, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!303 = !DISubroutineType(types: !304)
!304 = !{!305, !307, !105, !308}
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!307 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !305)
!308 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !242)
!309 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !310, file: !229, line: 146)
!310 = !DISubprogram(name: "fputwc", scope: !235, file: !235, line: 743, type: !311, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!311 = !DISubroutineType(types: !312)
!312 = !{!231, !306, !242}
!313 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !314, file: !229, line: 147)
!314 = !DISubprogram(name: "fputws", scope: !235, file: !235, line: 765, type: !315, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!315 = !DISubroutineType(types: !316)
!316 = !{!105, !317, !308}
!317 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !306)
!320 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !321, file: !229, line: 148)
!321 = !DISubprogram(name: "fwide", scope: !235, file: !235, line: 573, type: !322, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!322 = !DISubroutineType(types: !323)
!323 = !{!105, !242, !105}
!324 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !325, file: !229, line: 149)
!325 = !DISubprogram(name: "fwprintf", scope: !235, file: !235, line: 580, type: !326, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!326 = !DISubroutineType(types: !327)
!327 = !{!105, !308, !317, null}
!328 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !329, file: !229, line: 150)
!329 = !DISubprogram(name: "fwscanf", linkageName: "__isoc99_fwscanf", scope: !235, file: !235, line: 642, type: !326, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!330 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !331, file: !229, line: 151)
!331 = !DISubprogram(name: "getwc", scope: !235, file: !235, line: 730, type: !240, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!332 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !333, file: !229, line: 152)
!333 = !DISubprogram(name: "getwchar", scope: !235, file: !235, line: 736, type: !334, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!334 = !DISubroutineType(types: !335)
!335 = !{!231}
!336 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !337, file: !229, line: 153)
!337 = !DISubprogram(name: "mbrlen", scope: !235, file: !235, line: 329, type: !338, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!338 = !DISubroutineType(types: !339)
!339 = !{!293, !340, !293, !343}
!340 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !226)
!343 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!345 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !346, file: !229, line: 154)
!346 = !DISubprogram(name: "mbrtowc", scope: !235, file: !235, line: 296, type: !347, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!347 = !DISubroutineType(types: !348)
!348 = !{!293, !307, !340, !293, !343}
!349 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !350, file: !229, line: 155)
!350 = !DISubprogram(name: "mbsinit", scope: !235, file: !235, line: 292, type: !351, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!351 = !DISubroutineType(types: !352)
!352 = !{!105, !353}
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !213)
!355 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !356, file: !229, line: 156)
!356 = !DISubprogram(name: "mbsrtowcs", scope: !235, file: !235, line: 337, type: !357, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!357 = !DISubroutineType(types: !358)
!358 = !{!293, !307, !359, !293, !343}
!359 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!361 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !362, file: !229, line: 157)
!362 = !DISubprogram(name: "putwc", scope: !235, file: !235, line: 744, type: !311, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!363 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !364, file: !229, line: 158)
!364 = !DISubprogram(name: "putwchar", scope: !235, file: !235, line: 750, type: !365, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!365 = !DISubroutineType(types: !366)
!366 = !{!231, !306}
!367 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !368, file: !229, line: 160)
!368 = !DISubprogram(name: "swprintf", scope: !235, file: !235, line: 590, type: !369, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!369 = !DISubroutineType(types: !370)
!370 = !{!105, !307, !293, !317, null}
!371 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !372, file: !229, line: 162)
!372 = !DISubprogram(name: "swscanf", linkageName: "__isoc99_swscanf", scope: !235, file: !235, line: 649, type: !373, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!373 = !DISubroutineType(types: !374)
!374 = !{!105, !317, !317, null}
!375 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !376, file: !229, line: 163)
!376 = !DISubprogram(name: "ungetwc", scope: !235, file: !235, line: 773, type: !377, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!377 = !DISubroutineType(types: !378)
!378 = !{!231, !231, !242}
!379 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !380, file: !229, line: 164)
!380 = !DISubprogram(name: "vfwprintf", scope: !235, file: !235, line: 598, type: !381, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!381 = !DISubroutineType(types: !382)
!382 = !{!105, !308, !317, !383}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, flags: DIFlagTypePassByValue, elements: !385, identifier: "_ZTS13__va_list_tag")
!385 = !{!386, !388, !389, !390}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !384, file: !387, baseType: !29, size: 32)
!387 = !DIFile(filename: "test.C", directory: "/data/compilers/tests/benchmarks/pbbs/suffixArray/parallelRange")
!388 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !384, file: !387, baseType: !29, size: 32, offset: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !384, file: !387, baseType: !291, size: 64, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !384, file: !387, baseType: !291, size: 64, offset: 128)
!391 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !392, file: !229, line: 166)
!392 = !DISubprogram(name: "vfwscanf", linkageName: "__isoc99_vfwscanf", scope: !235, file: !235, line: 696, type: !381, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!393 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !394, file: !229, line: 169)
!394 = !DISubprogram(name: "vswprintf", scope: !235, file: !235, line: 611, type: !395, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!395 = !DISubroutineType(types: !396)
!396 = !{!105, !307, !293, !317, !383}
!397 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !398, file: !229, line: 172)
!398 = !DISubprogram(name: "vswscanf", linkageName: "__isoc99_vswscanf", scope: !235, file: !235, line: 703, type: !399, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!399 = !DISubroutineType(types: !400)
!400 = !{!105, !317, !317, !383}
!401 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !402, file: !229, line: 174)
!402 = !DISubprogram(name: "vwprintf", scope: !235, file: !235, line: 606, type: !403, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!403 = !DISubroutineType(types: !404)
!404 = !{!105, !317, !383}
!405 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !406, file: !229, line: 176)
!406 = !DISubprogram(name: "vwscanf", linkageName: "__isoc99_vwscanf", scope: !235, file: !235, line: 700, type: !403, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!407 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !408, file: !229, line: 178)
!408 = !DISubprogram(name: "wcrtomb", scope: !235, file: !235, line: 301, type: !409, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!409 = !DISubroutineType(types: !410)
!410 = !{!293, !411, !306, !343}
!411 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !250)
!412 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !413, file: !229, line: 179)
!413 = !DISubprogram(name: "wcscat", scope: !235, file: !235, line: 97, type: !414, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!414 = !DISubroutineType(types: !415)
!415 = !{!305, !307, !317}
!416 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !417, file: !229, line: 180)
!417 = !DISubprogram(name: "wcscmp", scope: !235, file: !235, line: 106, type: !418, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!418 = !DISubroutineType(types: !419)
!419 = !{!105, !318, !318}
!420 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !421, file: !229, line: 181)
!421 = !DISubprogram(name: "wcscoll", scope: !235, file: !235, line: 131, type: !418, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!422 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !423, file: !229, line: 182)
!423 = !DISubprogram(name: "wcscpy", scope: !235, file: !235, line: 87, type: !414, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!424 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !425, file: !229, line: 183)
!425 = !DISubprogram(name: "wcscspn", scope: !235, file: !235, line: 187, type: !426, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!426 = !DISubroutineType(types: !427)
!427 = !{!293, !318, !318}
!428 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !429, file: !229, line: 184)
!429 = !DISubprogram(name: "wcsftime", scope: !235, file: !235, line: 837, type: !430, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!430 = !DISubroutineType(types: !431)
!431 = !{!293, !307, !293, !317, !432}
!432 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !436, line: 7, size: 448, flags: DIFlagTypePassByValue, elements: !437, identifier: "_ZTS2tm")
!436 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "", checksumkind: CSK_MD5, checksum: "9e5545b565ef031c4cd0faf90b69386f")
!437 = !{!438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !435, file: !436, line: 9, baseType: !105, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !435, file: !436, line: 10, baseType: !105, size: 32, offset: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !435, file: !436, line: 11, baseType: !105, size: 32, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !435, file: !436, line: 12, baseType: !105, size: 32, offset: 96)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !435, file: !436, line: 13, baseType: !105, size: 32, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !435, file: !436, line: 14, baseType: !105, size: 32, offset: 160)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !435, file: !436, line: 15, baseType: !105, size: 32, offset: 192)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !435, file: !436, line: 16, baseType: !105, size: 32, offset: 224)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !435, file: !436, line: 17, baseType: !105, size: 32, offset: 256)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !435, file: !436, line: 20, baseType: !95, size: 64, offset: 320)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !435, file: !436, line: 21, baseType: !341, size: 64, offset: 384)
!449 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !450, file: !229, line: 185)
!450 = !DISubprogram(name: "wcslen", scope: !235, file: !235, line: 222, type: !451, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!451 = !DISubroutineType(types: !452)
!452 = !{!293, !318}
!453 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !454, file: !229, line: 186)
!454 = !DISubprogram(name: "wcsncat", scope: !235, file: !235, line: 101, type: !455, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!455 = !DISubroutineType(types: !456)
!456 = !{!305, !307, !317, !293}
!457 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !458, file: !229, line: 187)
!458 = !DISubprogram(name: "wcsncmp", scope: !235, file: !235, line: 109, type: !459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!459 = !DISubroutineType(types: !460)
!460 = !{!105, !318, !318, !293}
!461 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !462, file: !229, line: 188)
!462 = !DISubprogram(name: "wcsncpy", scope: !235, file: !235, line: 92, type: !455, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!463 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !464, file: !229, line: 189)
!464 = !DISubprogram(name: "wcsrtombs", scope: !235, file: !235, line: 343, type: !465, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!465 = !DISubroutineType(types: !466)
!466 = !{!293, !411, !467, !293, !343}
!467 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !468)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!469 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !470, file: !229, line: 190)
!470 = !DISubprogram(name: "wcsspn", scope: !235, file: !235, line: 191, type: !426, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!471 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !472, file: !229, line: 191)
!472 = !DISubprogram(name: "wcstod", scope: !235, file: !235, line: 377, type: !473, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!473 = !DISubroutineType(types: !474)
!474 = !{!81, !317, !475}
!475 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !476)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!477 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !478, file: !229, line: 193)
!478 = !DISubprogram(name: "wcstof", scope: !235, file: !235, line: 382, type: !479, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!479 = !DISubroutineType(types: !480)
!480 = !{!481, !317, !475}
!481 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!482 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !483, file: !229, line: 195)
!483 = !DISubprogram(name: "wcstok", scope: !235, file: !235, line: 217, type: !484, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!484 = !DISubroutineType(types: !485)
!485 = !{!305, !307, !317, !475}
!486 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !487, file: !229, line: 196)
!487 = !DISubprogram(name: "wcstol", scope: !235, file: !235, line: 428, type: !488, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!488 = !DISubroutineType(types: !489)
!489 = !{!95, !317, !475, !105}
!490 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !491, file: !229, line: 197)
!491 = !DISubprogram(name: "wcstoul", scope: !235, file: !235, line: 433, type: !492, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!492 = !DISubroutineType(types: !493)
!493 = !{!295, !317, !475, !105}
!494 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !495, file: !229, line: 198)
!495 = !DISubprogram(name: "wcsxfrm", scope: !235, file: !235, line: 135, type: !496, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!496 = !DISubroutineType(types: !497)
!497 = !{!293, !307, !317, !293}
!498 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !499, file: !229, line: 199)
!499 = !DISubprogram(name: "wctob", scope: !235, file: !235, line: 324, type: !500, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!500 = !DISubroutineType(types: !501)
!501 = !{!105, !231}
!502 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !503, file: !229, line: 200)
!503 = !DISubprogram(name: "wmemcmp", scope: !235, file: !235, line: 258, type: !459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!504 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !505, file: !229, line: 201)
!505 = !DISubprogram(name: "wmemcpy", scope: !235, file: !235, line: 262, type: !455, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!506 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !507, file: !229, line: 202)
!507 = !DISubprogram(name: "wmemmove", scope: !235, file: !235, line: 267, type: !508, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!508 = !DISubroutineType(types: !509)
!509 = !{!305, !305, !318, !293}
!510 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !511, file: !229, line: 203)
!511 = !DISubprogram(name: "wmemset", scope: !235, file: !235, line: 271, type: !512, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!512 = !DISubroutineType(types: !513)
!513 = !{!305, !305, !306, !293}
!514 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !515, file: !229, line: 204)
!515 = !DISubprogram(name: "wprintf", scope: !235, file: !235, line: 587, type: !516, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!516 = !DISubroutineType(types: !517)
!517 = !{!105, !317, null}
!518 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !519, file: !229, line: 205)
!519 = !DISubprogram(name: "wscanf", linkageName: "__isoc99_wscanf", scope: !235, file: !235, line: 646, type: !516, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!520 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !521, file: !229, line: 206)
!521 = !DISubprogram(name: "wcschr", scope: !235, file: !235, line: 164, type: !522, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!522 = !DISubroutineType(types: !523)
!523 = !{!305, !318, !306}
!524 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !525, file: !229, line: 207)
!525 = !DISubprogram(name: "wcspbrk", scope: !235, file: !235, line: 201, type: !526, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!526 = !DISubroutineType(types: !527)
!527 = !{!305, !318, !318}
!528 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !529, file: !229, line: 208)
!529 = !DISubprogram(name: "wcsrchr", scope: !235, file: !235, line: 174, type: !522, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!530 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !531, file: !229, line: 209)
!531 = !DISubprogram(name: "wcsstr", scope: !235, file: !235, line: 212, type: !526, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!532 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !533, file: !229, line: 210)
!533 = !DISubprogram(name: "wmemchr", scope: !235, file: !235, line: 253, type: !534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!534 = !DISubroutineType(types: !535)
!535 = !{!305, !318, !306, !293}
!536 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !537, entity: !538, file: !229, line: 251)
!537 = !DINamespace(name: "__gnu_cxx", scope: null)
!538 = !DISubprogram(name: "wcstold", scope: !235, file: !235, line: 384, type: !539, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!539 = !DISubroutineType(types: !540)
!540 = !{!541, !317, !475}
!541 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!542 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !537, entity: !543, file: !229, line: 260)
!543 = !DISubprogram(name: "wcstoll", scope: !235, file: !235, line: 441, type: !544, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!544 = !DISubroutineType(types: !545)
!545 = !{!546, !317, !475, !105}
!546 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!547 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !537, entity: !548, file: !229, line: 261)
!548 = !DISubprogram(name: "wcstoull", scope: !235, file: !235, line: 448, type: !549, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!549 = !DISubroutineType(types: !550)
!550 = !{!551, !317, !475, !105}
!551 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!552 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !538, file: !229, line: 267)
!553 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !543, file: !229, line: 268)
!554 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !548, file: !229, line: 269)
!555 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !478, file: !229, line: 283)
!556 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !392, file: !229, line: 286)
!557 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !398, file: !229, line: 289)
!558 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !406, file: !229, line: 292)
!559 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !538, file: !229, line: 296)
!560 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !543, file: !229, line: 297)
!561 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !548, file: !229, line: 298)
!562 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !563, file: !564, line: 68)
!563 = !DICompositeType(tag: DW_TAG_class_type, name: "exception_ptr", scope: !565, file: !564, line: 90, size: 64, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSNSt15__exception_ptr13exception_ptrE")
!564 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/11/../../../../include/c++/11/bits/exception_ptr.h", directory: "", checksumkind: CSK_MD5, checksum: "ed433011c81450fc2dabd9aa8a29a038")
!565 = !DINamespace(name: "__exception_ptr", scope: !2)
!566 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !565, entity: !567, file: !564, line: 84)
!567 = !DISubprogram(name: "rethrow_exception", linkageName: "_ZSt17rethrow_exceptionNSt15__exception_ptr13exception_ptrE", scope: !2, file: !564, line: 80, type: !568, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!568 = !DISubroutineType(types: !569)
!569 = !{null, !563}
!570 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !571, entity: !572, file: !573, line: 58)
!571 = !DINamespace(name: "__gnu_debug", scope: null)
!572 = !DINamespace(name: "__debug", scope: !2)
!573 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/11/../../../../include/c++/11/debug/debug.h", directory: "", checksumkind: CSK_MD5, checksum: "982c0103e1e5f86b0818efdfc5273c3c")
!574 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !575, file: !577, line: 47)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !92, line: 24, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !94, line: 37, baseType: !273)
!577 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/11/../../../../include/c++/11/cstdint", directory: "")
!578 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !579, file: !577, line: 48)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !92, line: 25, baseType: !580)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !94, line: 39, baseType: !581)
!581 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!582 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !583, file: !577, line: 49)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !92, line: 26, baseType: !584)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !94, line: 41, baseType: !105)
!585 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !91, file: !577, line: 50)
!586 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !587, file: !577, line: 52)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !588, line: 58, baseType: !273)
!588 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "8e56ab3ccd56760d8ae9848ebf326071")
!589 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !590, file: !577, line: 53)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !588, line: 60, baseType: !95)
!591 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !592, file: !577, line: 54)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !588, line: 61, baseType: !95)
!593 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !594, file: !577, line: 55)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !588, line: 62, baseType: !95)
!595 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !596, file: !577, line: 57)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !588, line: 43, baseType: !597)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least8_t", file: !94, line: 52, baseType: !576)
!598 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !599, file: !577, line: 58)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !588, line: 44, baseType: !600)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least16_t", file: !94, line: 54, baseType: !580)
!601 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !602, file: !577, line: 59)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !588, line: 45, baseType: !603)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least32_t", file: !94, line: 56, baseType: !584)
!604 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !605, file: !577, line: 60)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !588, line: 46, baseType: !606)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least64_t", file: !94, line: 58, baseType: !93)
!607 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !608, file: !577, line: 62)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !588, line: 101, baseType: !609)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !94, line: 72, baseType: !95)
!610 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !611, file: !577, line: 63)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !588, line: 87, baseType: !95)
!612 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !613, file: !577, line: 65)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !614, line: 24, baseType: !615)
!614 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "3d2fbc5d847dd222c2fbd70457568436")
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !94, line: 38, baseType: !616)
!616 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!617 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !618, file: !577, line: 66)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !614, line: 25, baseType: !619)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !94, line: 40, baseType: !271)
!620 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !621, file: !577, line: 67)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !614, line: 26, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !94, line: 42, baseType: !29)
!623 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !624, file: !577, line: 68)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !614, line: 27, baseType: !625)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !94, line: 45, baseType: !295)
!626 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !627, file: !577, line: 70)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !588, line: 71, baseType: !616)
!628 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !629, file: !577, line: 71)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !588, line: 73, baseType: !295)
!630 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !631, file: !577, line: 72)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !588, line: 74, baseType: !295)
!632 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !633, file: !577, line: 73)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !588, line: 75, baseType: !295)
!634 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !635, file: !577, line: 75)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !588, line: 49, baseType: !636)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least8_t", file: !94, line: 53, baseType: !615)
!637 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !638, file: !577, line: 76)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !588, line: 50, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least16_t", file: !94, line: 55, baseType: !619)
!640 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !641, file: !577, line: 77)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !588, line: 51, baseType: !642)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !94, line: 57, baseType: !622)
!643 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !644, file: !577, line: 78)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !588, line: 52, baseType: !645)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least64_t", file: !94, line: 59, baseType: !625)
!646 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !647, file: !577, line: 80)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !588, line: 102, baseType: !648)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !94, line: 73, baseType: !295)
!649 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !650, file: !577, line: 81)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !588, line: 90, baseType: !295)
!651 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !652, file: !654, line: 53)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !653, line: 51, size: 768, flags: DIFlagFwdDecl, identifier: "_ZTS5lconv")
!653 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "b571a77bd0c672d342463a67f7e149fa")
!654 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/11/../../../../include/c++/11/clocale", directory: "")
!655 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !656, file: !654, line: 54)
!656 = !DISubprogram(name: "setlocale", scope: !653, file: !653, line: 122, type: !657, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!657 = !DISubroutineType(types: !658)
!658 = !{!250, !105, !341}
!659 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !660, file: !654, line: 55)
!660 = !DISubprogram(name: "localeconv", scope: !653, file: !653, line: 125, type: !661, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!661 = !DISubroutineType(types: !662)
!662 = !{!663}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!664 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !665, file: !669, line: 64)
!665 = !DISubprogram(name: "isalnum", scope: !666, file: !666, line: 108, type: !667, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!666 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "fd7caa83cd0622339ddad5c2c7766455")
!667 = !DISubroutineType(types: !668)
!668 = !{!105, !105}
!669 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/11/../../../../include/c++/11/cctype", directory: "")
!670 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !671, file: !669, line: 65)
!671 = !DISubprogram(name: "isalpha", scope: !666, file: !666, line: 109, type: !667, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!672 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !673, file: !669, line: 66)
!673 = !DISubprogram(name: "iscntrl", scope: !666, file: !666, line: 110, type: !667, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!674 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !675, file: !669, line: 67)
!675 = !DISubprogram(name: "isdigit", scope: !666, file: !666, line: 111, type: !667, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!676 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !677, file: !669, line: 68)
!677 = !DISubprogram(name: "isgraph", scope: !666, file: !666, line: 113, type: !667, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!678 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !679, file: !669, line: 69)
!679 = !DISubprogram(name: "islower", scope: !666, file: !666, line: 112, type: !667, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!680 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !681, file: !669, line: 70)
!681 = !DISubprogram(name: "isprint", scope: !666, file: !666, line: 114, type: !667, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!682 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !683, file: !669, line: 71)
!683 = !DISubprogram(name: "ispunct", scope: !666, file: !666, line: 115, type: !667, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!684 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !685, file: !669, line: 72)
!685 = !DISubprogram(name: "isspace", scope: !666, file: !666, line: 116, type: !667, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!686 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !687, file: !669, line: 73)
!687 = !DISubprogram(name: "isupper", scope: !666, file: !666, line: 117, type: !667, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!688 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !689, file: !669, line: 74)
!689 = !DISubprogram(name: "isxdigit", scope: !666, file: !666, line: 118, type: !667, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!690 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !691, file: !669, line: 75)
!691 = !DISubprogram(name: "tolower", scope: !666, file: !666, line: 122, type: !667, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!692 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !693, file: !669, line: 76)
!693 = !DISubprogram(name: "toupper", scope: !666, file: !666, line: 125, type: !667, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!694 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !695, file: !669, line: 87)
!695 = !DISubprogram(name: "isblank", scope: !666, file: !666, line: 130, type: !667, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!696 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !697, file: !699, line: 52)
!697 = !DISubprogram(name: "abs", scope: !698, file: !698, line: 840, type: !667, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!698 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "32dbbe9742ce68cd5089d66404ab1df2")
!699 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/11/../../../../include/c++/11/bits/std_abs.h", directory: "")
!700 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !701, file: !703, line: 127)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !698, line: 62, baseType: !702)
!702 = !DICompositeType(tag: DW_TAG_structure_type, file: !698, line: 58, size: 64, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!703 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/11/../../../../include/c++/11/cstdlib", directory: "")
!704 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !705, file: !703, line: 128)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !698, line: 70, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !698, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !707, identifier: "_ZTS6ldiv_t")
!707 = !{!708, !709}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !706, file: !698, line: 68, baseType: !95, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !706, file: !698, line: 69, baseType: !95, size: 64, offset: 64)
!710 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !711, file: !703, line: 130)
!711 = !DISubprogram(name: "abort", scope: !698, file: !698, line: 591, type: !712, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!712 = !DISubroutineType(types: !713)
!713 = !{null}
!714 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !715, file: !703, line: 134)
!715 = !DISubprogram(name: "atexit", scope: !698, file: !698, line: 595, type: !716, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!716 = !DISubroutineType(types: !717)
!717 = !{!105, !718}
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!719 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !720, file: !703, line: 137)
!720 = !DISubprogram(name: "at_quick_exit", scope: !698, file: !698, line: 600, type: !716, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!721 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !722, file: !703, line: 140)
!722 = !DISubprogram(name: "atof", scope: !723, file: !723, line: 25, type: !724, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!723 = !DIFile(filename: "/usr/include/bits/stdlib-float.h", directory: "", checksumkind: CSK_MD5, checksum: "bf68752e10fc88c6bb602531989601f3")
!724 = !DISubroutineType(types: !725)
!725 = !{!81, !341}
!726 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !727, file: !703, line: 141)
!727 = !DISubprogram(name: "atoi", scope: !698, file: !698, line: 361, type: !728, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!728 = !DISubroutineType(types: !729)
!729 = !{!105, !341}
!730 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !731, file: !703, line: 142)
!731 = !DISubprogram(name: "atol", scope: !698, file: !698, line: 366, type: !732, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!732 = !DISubroutineType(types: !733)
!733 = !{!95, !341}
!734 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !735, file: !703, line: 143)
!735 = !DISubprogram(name: "bsearch", scope: !736, file: !736, line: 20, type: !737, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!736 = !DIFile(filename: "/usr/include/bits/stdlib-bsearch.h", directory: "", checksumkind: CSK_MD5, checksum: "d2375e366936c7cee2694953ba81abce")
!737 = !DISubroutineType(types: !738)
!738 = !{!291, !739, !739, !293, !293, !741}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !698, line: 808, baseType: !742)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!105, !739, !739}
!745 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !746, file: !703, line: 144)
!746 = !DISubprogram(name: "calloc", scope: !698, file: !698, line: 542, type: !747, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!747 = !DISubroutineType(types: !748)
!748 = !{!291, !293, !293}
!749 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !750, file: !703, line: 145)
!750 = !DISubprogram(name: "div", scope: !698, file: !698, line: 852, type: !751, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!751 = !DISubroutineType(types: !752)
!752 = !{!701, !105, !105}
!753 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !754, file: !703, line: 146)
!754 = !DISubprogram(name: "exit", scope: !698, file: !698, line: 617, type: !755, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!755 = !DISubroutineType(types: !756)
!756 = !{null, !105}
!757 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !758, file: !703, line: 147)
!758 = !DISubprogram(name: "free", scope: !698, file: !698, line: 565, type: !759, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!759 = !DISubroutineType(types: !760)
!760 = !{null, !291}
!761 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !762, file: !703, line: 148)
!762 = !DISubprogram(name: "getenv", scope: !698, file: !698, line: 634, type: !763, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!763 = !DISubroutineType(types: !764)
!764 = !{!250, !341}
!765 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !766, file: !703, line: 149)
!766 = !DISubprogram(name: "labs", scope: !698, file: !698, line: 841, type: !767, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!767 = !DISubroutineType(types: !768)
!768 = !{!95, !95}
!769 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !770, file: !703, line: 150)
!770 = !DISubprogram(name: "ldiv", scope: !698, file: !698, line: 854, type: !771, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!771 = !DISubroutineType(types: !772)
!772 = !{!705, !95, !95}
!773 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !774, file: !703, line: 151)
!774 = !DISubprogram(name: "malloc", scope: !698, file: !698, line: 539, type: !775, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!775 = !DISubroutineType(types: !776)
!776 = !{!291, !293}
!777 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !778, file: !703, line: 153)
!778 = !DISubprogram(name: "mblen", scope: !698, file: !698, line: 922, type: !779, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!779 = !DISubroutineType(types: !780)
!780 = !{!105, !341, !293}
!781 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !782, file: !703, line: 154)
!782 = !DISubprogram(name: "mbstowcs", scope: !698, file: !698, line: 933, type: !783, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!783 = !DISubroutineType(types: !784)
!784 = !{!293, !307, !340, !293}
!785 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !786, file: !703, line: 155)
!786 = !DISubprogram(name: "mbtowc", scope: !698, file: !698, line: 925, type: !787, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!787 = !DISubroutineType(types: !788)
!788 = !{!105, !307, !340, !293}
!789 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !790, file: !703, line: 157)
!790 = !DISubprogram(name: "qsort", scope: !698, file: !698, line: 830, type: !791, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!791 = !DISubroutineType(types: !792)
!792 = !{null, !291, !293, !293, !741}
!793 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !794, file: !703, line: 160)
!794 = !DISubprogram(name: "quick_exit", scope: !698, file: !698, line: 623, type: !755, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!795 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !796, file: !703, line: 163)
!796 = !DISubprogram(name: "rand", scope: !698, file: !698, line: 453, type: !797, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!797 = !DISubroutineType(types: !798)
!798 = !{!105}
!799 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !800, file: !703, line: 164)
!800 = !DISubprogram(name: "realloc", scope: !698, file: !698, line: 550, type: !801, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!801 = !DISubroutineType(types: !802)
!802 = !{!291, !291, !293}
!803 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !804, file: !703, line: 165)
!804 = !DISubprogram(name: "srand", scope: !698, file: !698, line: 455, type: !805, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!805 = !DISubroutineType(types: !806)
!806 = !{null, !29}
!807 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !808, file: !703, line: 166)
!808 = !DISubprogram(name: "strtod", scope: !698, file: !698, line: 117, type: !809, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!809 = !DISubroutineType(types: !810)
!810 = !{!81, !340, !811}
!811 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !812)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!813 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !814, file: !703, line: 167)
!814 = !DISubprogram(name: "strtol", scope: !698, file: !698, line: 176, type: !815, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!815 = !DISubroutineType(types: !816)
!816 = !{!95, !340, !811, !105}
!817 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !818, file: !703, line: 168)
!818 = !DISubprogram(name: "strtoul", scope: !698, file: !698, line: 180, type: !819, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!819 = !DISubroutineType(types: !820)
!820 = !{!295, !340, !811, !105}
!821 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !822, file: !703, line: 169)
!822 = !DISubprogram(name: "system", scope: !698, file: !698, line: 784, type: !728, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!823 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !824, file: !703, line: 171)
!824 = !DISubprogram(name: "wcstombs", scope: !698, file: !698, line: 937, type: !825, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!825 = !DISubroutineType(types: !826)
!826 = !{!293, !411, !317, !293}
!827 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !828, file: !703, line: 172)
!828 = !DISubprogram(name: "wctomb", scope: !698, file: !698, line: 929, type: !829, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!829 = !DISubroutineType(types: !830)
!830 = !{!105, !250, !306}
!831 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !537, entity: !832, file: !703, line: 200)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !698, line: 80, baseType: !833)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !698, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !834, identifier: "_ZTS7lldiv_t")
!834 = !{!835, !836}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !833, file: !698, line: 78, baseType: !546, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !833, file: !698, line: 79, baseType: !546, size: 64, offset: 64)
!837 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !537, entity: !838, file: !703, line: 206)
!838 = !DISubprogram(name: "_Exit", scope: !698, file: !698, line: 629, type: !755, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!839 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !537, entity: !840, file: !703, line: 210)
!840 = !DISubprogram(name: "llabs", scope: !698, file: !698, line: 844, type: !841, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!841 = !DISubroutineType(types: !842)
!842 = !{!546, !546}
!843 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !537, entity: !844, file: !703, line: 216)
!844 = !DISubprogram(name: "lldiv", scope: !698, file: !698, line: 858, type: !845, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!845 = !DISubroutineType(types: !846)
!846 = !{!832, !546, !546}
!847 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !537, entity: !848, file: !703, line: 227)
!848 = !DISubprogram(name: "atoll", scope: !698, file: !698, line: 373, type: !849, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!849 = !DISubroutineType(types: !850)
!850 = !{!546, !341}
!851 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !537, entity: !852, file: !703, line: 228)
!852 = !DISubprogram(name: "strtoll", scope: !698, file: !698, line: 200, type: !853, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!853 = !DISubroutineType(types: !854)
!854 = !{!546, !340, !811, !105}
!855 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !537, entity: !856, file: !703, line: 229)
!856 = !DISubprogram(name: "strtoull", scope: !698, file: !698, line: 205, type: !857, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!857 = !DISubroutineType(types: !858)
!858 = !{!551, !340, !811, !105}
!859 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !537, entity: !860, file: !703, line: 231)
!860 = !DISubprogram(name: "strtof", scope: !698, file: !698, line: 123, type: !861, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!861 = !DISubroutineType(types: !862)
!862 = !{!481, !340, !811}
!863 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !537, entity: !864, file: !703, line: 232)
!864 = !DISubprogram(name: "strtold", scope: !698, file: !698, line: 126, type: !865, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!865 = !DISubroutineType(types: !866)
!866 = !{!541, !340, !811}
!867 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !832, file: !703, line: 240)
!868 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !838, file: !703, line: 242)
!869 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !840, file: !703, line: 244)
!870 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !871, file: !703, line: 245)
!871 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !537, file: !703, line: 213, type: !845, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!872 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !844, file: !703, line: 246)
!873 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !848, file: !703, line: 248)
!874 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !860, file: !703, line: 249)
!875 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !852, file: !703, line: 250)
!876 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !856, file: !703, line: 251)
!877 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !864, file: !703, line: 252)
!878 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !879, file: !881, line: 98)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !880, line: 7, baseType: !245)
